DataProcessors/Лео_ВыгрузкаСвойствКонтрагентов/Лео_ВыгрузкаСвойствКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Лео_ВыгрузкаСвойствКонтрагентов</name>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипДома</name>
    <type>
      <types>EnumRef.ТипыДомов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКорпуса</name>
    <type>
      <types>EnumRef.ТипыКорпусов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКвартиры</name>
    <type>
      <types>EnumRef.ТипыКвартир</types>
    </type>
  </resources>
  <resources>
    <name>абс_ФайлДопДанных</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ТипАдреса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ЛичныеКонтакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ДатаАктуальностиКИ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>EmailОрганизации</name>
      <description>Email организации</description>
    </items>
    <items>
      <name>EmailФизЛица</name>
      <description>Email физ. лица</description>
    </items>
    <items>
      <name>ИнформАдресФизЛица</name>
      <description>Адрес для информирования физ. лица</description>
    </items>
    <items>
      <name>АдресДоставкиКонтрагента</name>
      <description>Адрес доставки</description>
    </items>
    <items>
      <name>ЮрАдресФизЛица</name>
      <description>Адрес по прописке физ. лица</description>
    </items>
    <items>
      <name>ФактАдресФизЛица</name>
      <description>Адрес проживания физ. лица</description>
    </items>
    <items>
      <name>ИнострАдресФизЛица</name>
      <description>Адрес физ. лица за пределами РФ </description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыКонтактногоЛицаКонтрагента</name>
      <description>Адрес электронной почты контактного лица контрагента</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами</name>
      <description>Адрес электронной почты контрагента для обмена электронными документами</description>
    </items>
    <items>
      <name>КонтактнТелефонКандидата</name>
      <description>Контактн телефон кандидата</description>
    </items>
    <items>
      <name>абс_МестоДоставки</name>
      <description>Место доставки</description>
    </items>
    <items>
      <name>МобильныйТелефонКонтактногоЛицаКонтрагента</name>
      <description>Мобильный телефон контактного лица контрагента</description>
    </items>
    <items>
      <name>АдресОрганизацииПочтовый</name>
      <description>Почтовый адрес организации</description>
    </items>
    <items>
      <name>РабочийТелефонКонтактногоЛицаКонтрагента</name>
      <description>Рабочий телефон контактного лица контрагента</description>
    </items>
    <items>
      <name>СлужебныйАдресЭлектроннойПочтыПользователя</name>
      <description>Служебный адрес электронной почты пользователя</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ТелефонОрганизации</name>
      <description>Телефон организации</description>
    </items>
    <items>
      <name>ТелефонПоЮрАдресуОрганизации</name>
      <description>Телефон по юридическому адресу организации</description>
    </items>
    <items>
      <name>ТелефонФизЛица</name>
      <description>Телефон физ.лица домашний</description>
    </items>
    <items>
      <name>ТелефонСлужебный</name>
      <description>Телефон физ.лица служебный</description>
    </items>
    <items>
      <name>АдресИнострОрганизацииУчред</name>
      <description>Учредительный адрес иностранной организации</description>
    </items>
    <items>
      <name>ФаксКонтрагента</name>
      <description>Факс контрагента</description>
    </items>
    <items>
      <name>ФаксОрганизации</name>
      <description>Факс организации</description>
    </items>
    <items>
      <name>ФактАдресКонтрагента</name>
      <description>Фактический адрес контрагента</description>
    </items>
    <items>
      <name>ФактАдресОрганизации</name>
      <description>Фактический адрес организации</description>
    </items>
    <items>
      <name>ЮрАдресКонтрагента</name>
      <description>Юридический адрес контрагента</description>
    </items>
    <items>
      <name>ЮрАдресОрганизации</name>
      <description>Юридический адрес организации</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъектаКонтактнойИнформации</name>
    <type>
      <types>EnumRef.ВидыОбъектовКонтактнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

DataProcessors/Лео_ВыгрузкаСвойствКонтрагентов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПоказатьВыгрузку(Команда)
	Запрос = ПолучитьЗапрос ();
	Результат = Запрос.Выполнить();
    ТабДокумент = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Результат);       
	Построитель.Вывести(ТабДокумент);
    ТабДокумент.Показать();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрос ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ВЫРАЗИТЬ(Контрагенты.Код КАК СТРОКА(15)) КАК Код_клиента,
	 |	ВЫРАЗИТЬ(КонтактнаяИнформация.Поле4 КАК СТРОКА(100)) КАК Город,
	 |	ВЫРАЗИТЬ(КонтактнаяИнформация.Поле2 КАК СТРОКА(100)) КАК Область,
	 |	ЕСТЬNULL(Контрагенты.абс_БизнесРегион, """") КАК БизнесРегион,
	 |	Контрагенты.Наименование КАК НаименованиеКлиента,
	 |	Канал.Значение КАК Канал,
	 |	ЕСТЬNULL(Контрагенты.абс_Отдел, """") КАК Отдел,
	 |	КонтрагентыМенеджерыПокупателя.МенеджерПокупателя,
	 |	Контрагенты.НаименованиеПолное КАК СводныйКлиент
	 |ИЗ
	 |	Справочник.Контрагенты КАК Контрагенты
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |		ПО (КонтактнаяИнформация.Объект = Контрагенты.Ссылка)
	 |			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	 |			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.МенеджерыПокупателя КАК КонтрагентыМенеджерыПокупателя
	 |		ПО (КонтрагентыМенеджерыПокупателя.Ссылка = Контрагенты.Ссылка)
	 |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	 |			ЗначенияСвойствОбъектов.Значение КАК Значение,
	 |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	 |			ЗначенияСвойствОбъектов.Свойство КАК Свойство
	 |		ИЗ
	 |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	 |		ГДЕ
	 |			ЗначенияСвойствОбъектов.Свойство = &Канал) КАК Канал
	 |		ПО Контрагенты.Ссылка = Канал.Объект";
	
	Запрос.УстановитьПараметр("Канал", ПланыВидовХарактеристик.СвойстваОбъектов.абс_Канал);
	
	Возврат Запрос;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьФайл(Команда)
	Попытка
		
		Запрос = ПолучитьЗапрос ();
		Результат = Запрос.Выполнить();
	    ТабДокумент = Новый ТабличныйДокумент;
		Построитель = Новый ПостроительОтчета;
		Построитель.ИсточникДанных=Новый ОписаниеИсточникаДанных(Результат);       
		Построитель.Вывести(ТабДокумент);

		
		ИмяДокумента = "Kontragent_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабДокумент.Записать(Объект.ПутьКФайлу+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		Сообщить("Файл " + ИмяДокумента + " сформирован." )
	Исключение
		Сообщить("Не удалось сформировать файл." )
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
    Если Диалог.Выбрать() Тогда
        Объект.ПутьКФайлу = Диалог.Каталог + "\";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ПутьКФайлу =  "\\air\Sales\Cube\1С\"  ;
КонецПроцедуры
